{
  "items": [
    {
      "name": "William Brander",
      "company": "Particular Software",
      "social": {
        "twitter": "williambZA",
        "linkedin": "william-brander-ba38b1117"
      },
      "tag": "william-brander",
      "description": "<p>A professional geek, William works for Particular Software writing amazing software like NServiceBus. Passionate about the web, he is engaged in a sordid love affair with JavaScript, and spends most of his free time trying to convince others of it’s beauty and elegance.</p><p>When not behind his laptop hacking away, this amateur beer enthusiast can often be found playing boardgames or drinking cold-brew coffee.</p>"
    },
    {
      "name": "Ola Kunysz",
      "company": "Tipser",
      "social": {
        "twitter": "olaqnysz",
        "linkedin": "akunysz"
      },
      "tag": "ola-kunysz",
      "description": "<p>Ola Kunysz is a programmer with 11 years of experience in software engineering, going it's through all stages, from business analysis to backend programming. Her biggest interest is solving real-life problems and writing code that matters. For 2 years she organised meetups and workshops of Geek Girls Carrots in Wrocław. She enjoys meeting people and working on interesting projects, so you can meet her on hackathons and conferences. When it’s time to relax, she’s offline [with dog(s), playing board games, in the forest, in the mountains]*.</p>"
    },
    {
      "name": "Bernd Rücker",
      "company": "Camunda",
      "social": {
        "twitter": "berndruecker",
        "linkedin": "bernd-ruecker-21661122"
      },
      "tag": "bernd-rucker",
      "description": "<p>Throughout my 15+ years in software development, I have helped automating highly scalable core workflows at global companies including T-Mobile, Lufthansa and Zalando. I have contributed to various open source workflow engines. I am co-founder and developer advocate of Camunda, an open source software company reinventing workflow automation. I co-authored \"Real-Life BPMN,\" a popular book about workflow modeling and automation, now in its fifth edition and available in English, German and Spanish. I regularly speak at conferences and write for various magazines. I am currently focused on new workflow automation paradigms that fit into modern architectures around distributed systems, microservices, domain-driven design, event-driven architecture and reactive systems.</p>"
    },
    {
      "name": "Markus Winand",
      "company": "Independent Consultant",
      "social": {
        "twitter": "MarkusWinand",
        "linkedin": "markuswinand"
      },
      "tag": "markus-winand",
      "description": "<p>Markus Winand is an independent author, trainer and consultant on all things SQL. His book “SQL Performance Explained” has just been translated into a fifth language. It can be purchased as a print edition, and it’s also available to read for free on his use-the-index-luke.com website. Markus is currently working on his second book centered on the idea that things have changed a lot since SQL-92. It is likewise available free of charge online (modern-sql.com).</p>"
    },
    {
      "name": "Dave Aronson",
      "company": "Codosaurus, LLC",
      "social": {
        "twitter": "davearonson",
        "linkedin": "davearonson"
      },
      "tag": "dave-aronson",
      "description": "<p>The speaker, Dave Aronson, has over three decades of professional software development experience, in a wide variety of languages, systems, techniques, and domains, mostly in Ruby for the past several years and mostly in C before that. He is the T. Rex of <a href='http://www.Codosaur.us/'>Codosaurus, LLC</a> in Fairfax, Virginia, a suburb of Washington DC. What he really does is “software development consulting”, which means not only cranking out code, but also advising development teams on processes, techniques, and tools; training and mentoring developers; and roadmapping projects. He is married, and co-owned by two cats (see their playlists on <a href='https://www.youtube.com/davearonson'>https://www.youtube.com/davearonson</a>). He also enjoys dark beers, smokey scotches and bourbons, playing guitar, and shooting targets.</p>"
    },
    {
      "name": "Julie Matviyuk",
      "company": "Symantec",
      "social": {
        "twitter": "jmatviyuk",
        "linkedin": "juliematviyuk"
      },
      "tag": "julie-matviyuk",
      "description": "<p>Platform Engineering Manager (Agile) at Symantec, keeping the antivirus in check since 2005. French, happily living in Ireland. Jacques of all trades, master of science (Security and Forensic Computing). I want to bridge the gap between InfoSec and Software Development. When I’m not hunting False Positives, I split my time between my cat and my garden.</p>"
    },
    {
      "name": "Marek Stój",
      "company": "ImmSoft",
      "social": {
        "twitter": "MarekStoj",
        "linkedin": "marekstoj"
      },
      "tag": "marek-stoj",
      "description": "<p>Marek is an experienced software developer. During his professional career spanning more than 10 years, he worked with technologies like .NET, C#, Android, Java, Big Data or Scala. Marek is simply a computer geek, specifically fascinated by the ever-growing influence of theoretical foundations of computer science on the IT industry.</p><p>Today it is not his career that is important though, because Marek also realized recently, that a passion can easily turn into an obsession which blinds us from the truth - that there is more to life than coding. And this idea, he believes, is worth spreading among fellow IT geeks.</p>"
    },
    {
      "name": "Philipp Krenn",
      "company": "Elastic",
      "social": {
        "twitter": "xeraa",
        "linkedin": "philippkrenn"
      },
      "tag": "philipp-krenn",
      "description": "<p>Philipp is part of the infrastructure team and a developer advocate at Elastic. He is frequently talking about full-text search, databases, operations, and security. Additionally, he is organizing multiple meetups in Vienna.</p>"
    },
    {
      "name": "Adam Ralph",
      "company": "Particular Software",
      "social": {
        "twitter": "adamralph",
        "linkedin": "adamralph"
      },
      "tag": "adam-ralph",
      "description": "<p>Adam is a distributed systems enthusiast and digital nomad. He works for Particular Software, the makers of NServiceBus. He likes to speak, maintain open source projects, and fix white space rule violations. He is a practiced tea drinker and snowboarder. He’s often spotted coding in launderettes throughout Western Europe.</p>"
    },
    {
      "name": "Dominick Baier",
      "company": "Independent Consultant",
      "social": {
        "twitter": "leastprivilege",
        "linkedin": "dominickbaier"
      },
      "tag": "dominick-baier",
      "description": "<p>Dominick Baier is an independent consultant specializing in identity & access control. He helps companies around the world designing & implementing authentication and authorization for their distributed web and native applications. He’s the co-author of the popular OpenID Connect & OAuth 2.0 framework called <a href=\"https://identityserver.io\">IdentityServer</a>, has written a couple of books, blogs at <a href=\"https://leastprivilege.com\">https://leastprivilege.com</a> and tweets as <a href=\"https://twitter.com/leastprivilege\">@leastprivilege</a>.</p>"
    },
    {
      "name": "Agnieszka Jach",
      "company": "mBank",
      "social": {
        "twitter": "aga_jach",
        "linkedin": "agnieszka-jach-a21342a6"
      },
      "tag": "agnieszka-jach",
      "description": "<p>She is a recent graduate of University of Technology in Łódź. She was a leader of .NET group at university sharing her passion to technology with other students. Currently working with mBank team as full stack developer. Loving conferences, sharing knowledge and always staying for one more drink. When she is not coding, she lifts.</p>"
    },
    {
      "name": "James Allardice",
      "company": "orangejellyfish",
      "social": {
        "twitter": "james_allardice",
        "linkedin": "jamesallardice"
      },
      "tag": "james-allardice",
      "description": "<p>James is a senior engineer with several years experience building single page web apps with Node.js and a variety of front-end technologies. He’s the co-founder of orangejellyfish, a software consultancy based in London with a passion for JavaScript, open source software and the cloud. In his spare time he enjoys answering tricky questions on Stack Overflow where he’s built up a reputation as a JavaScript expert.</p>"
    },
    {
      "name": "Michał Jankowski",
      "company": "Objectivity",
      "social": {
        "twitter": "JankowskiMichal",
        "linkedin": "michalmjankowski"
      },
      "tag": "michal-jankowski",
      "description": "<p>Michał Jankowski - an architect, designer and sometimes a developer. He began programming over twenty years ago starting from Basic and Assembler for 8-bit computers. For over ten years, he has been creating applications working on a .net platform for the world’s largest companies. Currently, he is specialising in the development of web applications and Azure environment.</p><p>A great enthusiast of software craftsmanship, unit testing, software design and other topics related to software development.</p><p>In his free time, when he is not playing with the code, he likes travelling, photography and writing a technical blog (<a href=\"http://www.jankowskimichal.pl/\">http://www.jankowskimichal.pl/</a>).</p>"
    },
    {
      "name": "Michał Łusiak",
      "company": "tretton37",
      "social": {
        "twitter": "mlusiak",
        "linkedin": "michal-lusiak"
      },
      "tag": "michal-lusiak",
      "description": "<p>Michał is software developer from Poland, currently living in Sweden. On the daily job, he works mostly with backends for web and mobile applications. He has worked with many programming stacks but currently focuses mostly on .NET. Big fan of functional languages. Recently interested in machine learning and data science. Aviation geek, skier and wheels of fury.</p>"
    },
    {
      "name": "Piotr Stapp",
      "company": "FinAi",
      "social": {
        "twitter": "ptrstpp950",
        "linkedin": "piotrstapp"
      },
      "tag": "piotr-stapp",
      "description": "<p>I call myself a developer, an engineer, a craftsman, a designer and a biker. I’m a user of every useful technology. I believe in people not papers. I’m adept at DevOps and automation. I love web technologies Formerly IT Expert at mBank, now IT Architect in FinAi. I’m also Microsoft MVP. My blog: <a href=\"https://stapp.space\">https://stapp.space</a>.</p>"
    },
    {
      "name": "Richard Lewington",
      "company": "Plain Concepts",
      "social": {
        "twitter": "plainconcepts",
        "linkedin": "richardlewington"
      },
      "tag": "richard-lewington",
      "description": "<p>CELTA, IDLTM, Dip TEFL, Microsoft MIE (Certified Microsoft Innovative Educator)</p><p>Richard Lewington is a Marketing Project Manager at Microsoft Mixed Reality partner Plain Concepts, Examiner & Invigilator at the University of Cambridge's assessment department & Teacher Trainer at The TEFL Academy in Madrid, Spain.</p><p>He has gained over 10 years experience teaching in a number of large corporations including Iberia, Clifford Chance & Barclays Bank, as well as through consulting for governmental institutions such as the Spanish Ministry of Industry, Tourism and Commerce, Ministry of Health and Social Policy & the Ministry of Science and Innovation.  He is also the author of the award-winning book ‘Stop Speaking Spanglish’.</p><p>His other achievements include participating in a Guinness World Record for cake eating in The Netherlands, managing a nightclub in The Canary Islands, and writing commercials featuring Antonio Banderas!</p><p>Richard is passionate about educational technology and is an advocate for its increased development and use across the world.  As such, he has gained over 30,000 followers on LinkedIn.</p>"
    },
    {
      "name": "Sander Hoogendoorn",
      "company": "Independent Consultant",
      "social": {
        "twitter": "aahoogendoorn",
        "linkedin": "aahoogendoorn"
      },
      "tag": "sander-hoogendoorn",
      "description": "<p>Sander is a dad, an independent consultant, software architect, programmer, speaker and writer. He coaches teams and helps improve architectures and code. He’s written books on agile, UML, and web tools, and published many articles. Sander is an inspiring (keynote) speaker at international conferences on topics such as agile, Scrum, continuous delivery, software estimation, agile requirements, modeling, patterns, software architectures, microservices, and web, Java and .NET development.</p>"
    },
    {
      "name": "Sebastian Gębski",
      "company": "Shedul.com",
      "social": {
        "twitter": "liveweird",
        "linkedin": "sebastian-gebski-2687bb"
      },
      "tag": "sebastian-gebski",
      "description": "<p>My name’s Sebastian Gębski. I think of myself as an Agilista (following the Kanban path); hardened in fire of several IT projects, mainly for large banks and insurance companies; polyglot architect, not afraid of putting his own hands on code if needed; zealot of Domain Driven Design. My job is to make things happen where others have failed, using common sense (that comes first), people (as this is not an individual sport) and technology (that usually is inevitable).</p>"
    },
    {
      "name": "Steven Schkolne",
      "company": "The Vain Company",
      "social": {
        "twitter": "schkolne",
        "linkedin": "sschkolne"
      },
      "tag": "steven-schkolne",
      "description": "<p>Steven Schkolne is one of the world’s foremost experts in interface design. For his PhD at Caltech he built the world's first full body VR painting software, laying the foundation for many of today’s VR builders such as TiltBrush and Quill. Today he continues to forge new paths with his innovation agency The Vain Company, which has done everything from building AR apps for kids in partnership with Crayola, to making the world's first robots react movie trailer for Fox, to building a life saving VR training application for utility workers. He puts his tireless exploration of the past, present, and future of computation, into frequent Medium articles, including a recent series on machine consciousness.</p>"
    },
    {
      "name": "Szymon Warda",
      "company": "Meniga",
      "social": {
        "twitter": "maklipsa",
        "linkedin": "szymonwarda"
      },
      "tag": "szymon-warda",
      "description": "<p>With .NET from version 1.1 and with web development from the time when IE6 was the “better” browser. Working with machine learning, cloud, and big data by day. By night a developer of cookit.pl- a pet project processing hundred of gigabytes of data with whatever suits the problem best (Graph databases/ML/C#/F#). Technology enthusiast, Neo4j ambassador, speaker, and a blogger at <a href=\"https://indexoutofrange.com/\">IndexOutOfRange.com</a>.</p>"
    },
    {
      "name": "Linda Rising",
      "company": "Independent Consultant",
      "social": {
        "twitter": "risinglinda",
        "linkedin": "lindarising"
      },
      "tag": "linda-rising",
      "description": "<p>Linda Rising has a Ph.D. from Arizona State University in the field of object-based design metrics and a background that includes university teaching and industry work in telecommunications, avionics, and strategic weapons systems.</p><p>An internationally known presenter on topics related to patterns, retrospectives, agile development approaches, and the change process, Linda is the author of numerous articles and five books: Design Patterns in Communications Software (SIGS Reference Library), The Pattern Almanac 2000, The Patterns Handbook: Techniques, Strategies, and Applications (SIGS Reference Library), Fearless Change: Patterns for Introducing New Ideas, and More Fearless Change: Strategies for Making Your Ideas Happen.</p>"
    },
    {
      "name": "Tomasz Pęczek",
      "company": "Oracle",
      "social": {
        "twitter": "tpeczek",
        "linkedin": "tpeczek"
      },
      "tag": "tomasz-peczek",
      "description": "<p>Developer, <a href=\"http://www.tpeczek.com/\">blogger</a>, speaker and <a href=\"https://github.com/tpeczek\">open source author/contributor</a> focused on Web Development in context of ASP.NET (Core) platform. For more than 10 years he has been creating web applications for health care, banking or e-learning industries. Currently he works in Oracle as an applications architect where his main areas of responsibility are web applications performance and security. Microsoft MVP in Visual Studio and Development Technologies category.</p>"
    },
    {
      "name": "Vladimir Dejanovic",
      "company": "",
      "social": {
        "twitter": "VladimirD_42",
        "linkedin": "vladimir-dejanovic-885ba74"
      },
      "tag": "vladimir-dejanovic",
      "description": "<p>Founder and leader of AmsterdamJUG.</p><p>Software Architect ,Team Lead and IT Consultant working in industry since 2006 developing high performance software in multiple programming languages and technologies from desktop to mobile and web with high load traffic.</p><p>Enjoining developing software mostly in Java and JavaScript, however also wrote fair share of code in Scala, C++, C, PHP, Go, Objective-C, Python, R, Lisp and many others.</p><p>Always interested in cool new stuff, Free and Open Source software.</p><p>Like giving talks at conferences like JavaOne 2016, JavaOne 2017, Devoxx BE, Devoxx US, Devoxx PL, Devoxx MA, Devoxx FR, JavaLand, Java Day Istanbul, Java Day Minks, Voxxed Days Bristol, Voxxed Days Bucharest, Voxxed Days Belgrade, Voxxed Days Cluj-Napoca, GeeCON and others.</p>"
    },
    {
      "name": "Zuzanna Pacholczyk",
      "company": "Capgemini",
      "social": {
        "linkedin": "pacholczyk"
      },
      "tag": "zuzanna-pacholczyk",
      "description": "<p>I am a senior software engineer at Capgemini in Wrocław. Currently working in a scrum team where I am a full stack dev playing with in Java and Angular technologies. I'm passionate about sharing my IT knowledge mostly as Carrots Foundation and company's Craftmanship community member. I'm a coorganizer and trainer during local workshops. Beside programming I take photos, do yoga and experiment in the kitchen (mostly successful :))</p>"
    },
    {
      "name": "James Birnie",
      "company": "ThoughtWorks",
      "social": {
        "twitter": "RunningChairJB",
        "linkedin": "jameswrbirnie"
      },
      "tag": "james-birnie",
      "description": "<p>I’ve been working on commercial software since the late 1990s. Back then TDD was something you studied but never did, pipelines were something that carried oil and agile and lean were words used to describe gymnasts. In 2006 I joined a startup and worked there for 9 years which included at least 3 major rewrites, cloud migrations and an Agile transformation. In 2015 I joined ThoughtWorks and I’ve since worked on several major projects on several very different technology stacks. Every day in my job I see things surprise me, shock me, disappoint me and sometimes delight me!</p>"
    },
    {
      "name": "Jakub Gutkowski",
      "company": "Independent Consultant",
      "social": {
        "twitter": "gutek",
        "linkedin": "jakubg"
      },
      "tag": "jakub-gutkowski",
      "description": "<p>Dad, husband, blogger, developer, geek. Founder of devWarsztaty – free workshops, for anyone who is willing to learn and practice software craftsmanship. Creator of first polish .NET Blogs agregator – .NET Blogs PL. Loves to play with novelties, learn new languages and libraries, avid conference attender, passionate about meeting new people, always willing to help.</p><p>Microsoft MVP.</p><p>Truly believes, that what he does, changes the world and helps others.</p>"
    },
    {
      "name": "Tugberk Ugurlu",
      "company": "Redgate",
      "social": {
        "twitter": "tourismgeek",
        "linkedin": "tugberk"
      },
      "tag": "tugberk-ugurlu",
      "description": "<p>I'm a self-motivated software guy who craves to create great software products and build effective development teams with 9 years of software development experience. I currently work as a Technical Lead at Redgate by leading a lean-minded product development team and I'm also a Microsoft MVP on development technologies.</p>"
    },
    {
      "name": "Spencer Schneidenbach",
      "company": "Aviron Software",
      "social": {
        "twitter": "schneidenbach",
        "linkedin": "sschneidenbach"
      },
      "tag": "spencer-schneidenbach",
      "description": "<p>Spencer Schneidenbach is a web developer, Microsoft MVP, speaker, consultant, and blogger in the St. Louis area, focusing on JavaScript/TypeScript, C#, React/Redux, and ASP.NET. He is the owner of Aviron Software, a consultancy specializing in cloud- and web-based software solutions.</p><p>Full speaking history and blog can be found at <a href=\"http://schneids.net\">http://schneids.net</a>.</p>"
    },
    {
      "name": "Rob Ashton",
      "company": "Independent Consultant",
      "social": {
        "twitter": "RobAshton"
      },
      "tag": "rob-ashton",
      "description": "<p></p>"
    },
    {
      "name": "Gunnar Peipman",
      "company": "Independent Consultant",
      "social": {
        "twitter": "gpeipman",
        "linkedin": "gpeipman"
      },
      "tag": "gunnar-peipman",
      "description": "<p>Gunnar Peipman is experienced software developer and active .NET community member from Tallinn, Estonia. Gunnar has grown up with coding and has worked on different Microsoft platforms and technologies right from primary school. Having seen technologies coming, going and evolving Gunnar has deep understanding of Microsoft technologies.</p>"
    },
    {
      "name": "Łukasz Dziekan",
      "company": "FinAi",
      "social": {
        "twitter": "Pan_dziekan",
        "linkedin": "lukaszdziekan"
      },
      "tag": "lukasz-dziekan",
      "description": "<p>Experienced technology leader combining deep and practical understanding of technology, machine learning and AI with experience in big data architectures, cloud and expert in data processing, data geek by heart. A manager that delivers expected (and sometimes unexpected) results, understands the client needs and wants his team to operate as efficiently as possible. Data science and applied Machine learning expert and leader. Data guy that loves slicing and dicing, building predictive models (that actually work) and managing analytics.</p>"
    }
  ]
}
